{
    "bls": {
        "title": "Beamline For Schools Proposal",
        "description": "Team captain for a research proposal to the CERN Beamline for Schools competition, shortlisted as a winning proposal. The project explores relativistic electron particle beam cross sections to improve high-accuracy beam collimation techniques, involving experimental physics, data modeling, and simulation.",
        "image": "static/setup2.png",
        "link": "https://beamline-for-schools.web.cern.ch/sites/default/files/BL4S_all-winners_2025.pdf"
    },
    "crowd": {
        "title": "Crowd Dynamics Lab Research",
        "description": "Conducted advanced network analysis on the terms of service of major online platforms at the University of Illinois Urbana-Champaign. The research focused on developing novel algorithms to parse, analyze, and visualize complex legal text, enhancing user transparency and understanding of their rights. Paper in press in the MIT URTC Proceedings 2025.",
        "image": "static/Reddit.png",
        "link": "https://github.com/CrazeXD/ToS-Complexity"
    },
    "exomoon": {
        "title": "Caltech Department of Geological and Planetary Sciences Research",
        "description": "Collaborated on research at Caltech with Dr. Apurva Oza to simulate the presence of exomoons around gas giant exoplanets. Published research in the Monthly Notice of the Royal Astronomical Society on sodium signatures around WASP-39b, using Monte Carlo and forward-modelling methods to align with telescope spectral data.",
        "image": "static/combined_mcmc_prometheus_models-1.png",
        "link": "https://academic.oup.com/mnras/advance-article/doi/10.1093/mnras/staf1526/8263929"
    },
    "python": {
        "title": "Python Projects Collection",
        "description": "A curated collection of my work in Python, from small scripts to complex applications. It showcases my proficiency in the language and my ability to tackle a variety of problems, including data structures, algorithms, and more.",
        "image": "",
        "link": "https://github.com/CrazeXD?tab=repositories"
    }
}